import React from 'react';

import Layout from '../layouts/layout';
import SEO from '../components/SEO/SEO';

const AboutPage = () => (
  <Layout>
    <SEO title="О сайте" />
    <div className="content">
      <h1>О сайте</h1>
      <p className="has-text-justified">
        Сайт <b>LinuxRussia.com</b> появился в далёком 2013 году. Изначально он
        был создан как записная книжка советов и инструкций по системе Linux, но
        с ростом популярности превратился в полноценный сайт с постоянной
        аудиторией читателей.
      </p>

      <p className="has-text-justified">
        На данном сайте публикуются статьи с обзорами и инструкциями по
        установке программ для Ubuntu/Linux, с советами и настройкой
        дистрибутива Ubuntu/Linux. Авторы сайта не стараются заменить
        официальную документацию дистрибутивов Linux. Мы просто делимся своим
        опытом и стараемся делать контент как можно качественнее и понятнее для
        наших читателей.
      </p>

      <h1>Контакты</h1>

      <h4>Сотрудничество</h4>
      <p className="has-text-justified">
        По вопросам сотрудничества, как коммерческого, так и иного пишите на
        адрес: <a href="mailto:admin@linuxrussia.com">admin@linuxrussia.com</a>,
        обсудим любое предложение.
      </p>

      <h4>Опубликовать новость или пресс-релиз</h4>
      <p className="has-text-justified">
        С удовольствием опубликуем пресс-релиз или новость об игре или программе
        для Linux. Статья о вашей игре или приложении должна быть уникальной,
        нигде не публиковаться прежде. Должна сопровождаться инструкцией и
        скриншотами. С таким материалом пишите на почтовый адрес:{' '}
        <a href="mailto:press@linuxrussia.com">press@linuxrussia.com</a>.
      </p>

      <h4>Стать автором</h4>
      <p className="has-text-justified">
        Если вы хотите поделиться полезной информацией с читателями этого сайта,
        то присылайте такой материал на почтовый ящик:{' '}
        <a href="mailto:admin@linuxrussia.com">admin@linuxrussia.com</a>.
      </p>
      <p className="has-text-justified">
        Текст должен быть качественным и сопровождаться скриншотами. Такая
        статья будет опубликована от вашего имени с указанием ссылки на ваш
        профиль в соц. сетях, почтовый адрес или сайт.
      </p>
      <p className="has-text-justified">
        Ко всему прочему, можем обговорить вариант оплачиваемого написания
        статей для этого сайта.
      </p>
    </div>
  </Layout>
);

export default AboutPage;
